app/controllers/session_controller.rb

  def login
    user = User.find_by :email=>params[:email]
---
SELECT "users".* FROM "users" WHERE "users"."email" = ? LIMIT ?  [["email", "last@test.com"], ["LIMIT", 1]]