app/controllers/trades_controller.rb

  def create
    @trade = Trade.new(trade_params)
    user = User.find_by_id(trade_params[:user_id])
    portfolio = user.portfolios.find_by_id(trade_params[:portfolio_id])
    coin = user.portfolios.first.coins.where(coin_id:trade_params[:coin_id])
    portfolio.current_balance = portfolio.current_balance - (trade_params[:quantity] * trade_params[:price])

    if @trade.save && portfolio.current_balance > 0
      if coin.count > 0
        # portfolio.save
        coin[0].quantity = coin[0].quantity + trade_params[:quantity]
        coin[0].save
      else
        Coin.create(:coin_name => trade_params[:coin_name], :coin_id => trade_params[:coin_id], :average_price => trade_params[:price], :quantity => trade_params[:quantity], :user_id => trade_params[:user_id], :portfolio_id => trade_params[:portfolio_id], :image => trade_params[:image])
      end
      portfolio.save
      user = User.find_by_id(trade_params[:user_id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? AND "portfolios"."id" = ? LIMIT ?  [["user_id", 1], ["id", 1], ["LIMIT", 1]]
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 4], ["LIMIT", 1]]
SELECT "coins".* FROM "coins" WHERE "coins"."portfolio_id" = ? AND "coins"."coin_id" = ? LIMIT ?  [["portfolio_id", 1], ["coin_id", "bitcoin"], ["LIMIT", 11]]
INSERT INTO "trades" ("coin_name", "coin_id", "price", "quantity", "user_id", "portfolio_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "portfolios" SET "current_balance" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["current_balance", 625233.4], ["updated_at", "2021-06-24 14:19:27.199155"], ["id", 1]]
SELECT "coins".* FROM "coins" INNER JOIN "portfolios" ON "coins"."portfolio_id" = "portfolios"."id" WHERE "portfolios"."user_id" = ?  [["user_id", 1]]
SELECT "portfolios".* FROM "portfolios" WHERE "portfolios"."user_id" = ? ORDER BY "portfolios"."id" ASC LIMIT ?  [["user_id", 1], ["LIMIT", 1]]
SELECT COUNT(*) FROM "coins" WHERE "coins"."portfolio_id" = ? AND "coins"."coin_id" = ?  [["portfolio_id", 1], ["coin_id", "bitcoin"]]
INSERT INTO "coins" ("coin_name", "coin_id", "average_price", "quantity", "user_id", "portfolio_id", "image", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
UPDATE "coins" SET "quantity" = ?, "updated_at" = ? WHERE "coins"."id" = ?  [["quantity", 2], ["updated_at", "2021-06-24 14:35:51.021673"], ["id", 1]]
UPDATE "portfolios" SET "current_balance" = ?, "updated_at" = ? WHERE "portfolios"."id" = ?  [["current_balance", 965874.0], ["updated_at", "2021-06-24 14:35:14.068026"], ["id", 1]]