app/controllers/users_controller.rb

  def index
    @users = User.all
---
SELECT "users".* FROM "users"

  def create
    user = User.new(user_params)

    if user.save
      # Creating an initial Portfolio for user.
      Portfolio.create(:name => "Initial Portfolio", :description => "For training", :initial_balance => 1000000, :user_id => user.id)
---
INSERT INTO "users" ("first_name", "last_name", "email", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
INSERT INTO "portfolios" ("name", "description", "initial_balance", "current_balance", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

    def set_user
      @user = User.find(params[:id])
---
SELECT "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]